Дни_рождения_EDT/src/AccumulationRegisters/СобранныеДеньги/СобранныеДеньги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СобранныеДеньги</name>
  <resources>
    <name>СуммаСдано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Именинник</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КтоСдал</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дни_рождения_EDT/src/AccumulationRegisters/СобранныеДеньги/RecordSetModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запись = РегистрыНакопления.СобранныеДеньги.СоздатьЗапись();
	Запись.Период = ТекущаяДата();
	Запись.Именинник = ЭтотОбъект.Именинник;
	Запись.КтоСдал = ЭтотОбъект.КтоСдал;
	Запись.СуммаСдано = ЭтотОбъект.СуммаСдано;
	Запись.Записать();
КонецПроцедуры
